OpenFoam/reports/report_1/sod/system/sample
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sample;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type                sets;
libs                ("libsampling.so");
interpolationScheme cellPoint;
setFormat           csv;

sets
(
    data
    {
        type    lineUniform;
        axis    x;
        start   (0 0 0);
        end     (1 0 0);
        nPoints 100;
    }
);

fields          (T rho p);


// ************************************************************************* //
