OpenFoam/reports/report_1/sod/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}

defaultFieldValues 
( 
    volVectorFieldValue U (0 0 0) 
    volScalarFieldValue T 0.00278
    volScalarFieldValue p 0.1
);

regions         
( 
    boxToCell 
    { 
        box (0 0 0) (0.5 1 1) ; 
        fieldValues 
        (
            volScalarFieldValue T 0.003458
            volScalarFieldValue p 1
        ); 
     } 
);
